apache/nuttx/boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
/****************************************************************************
 * boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/boardctl.h>
#include <sys/ioctl.h>
#include <sys/types.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <fcntl.h>
#include <string.h>
#include <unistd.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <dsp.h>

#include <nuttx/arch.h>
#include <nuttx/board.h>
#include <nuttx/fs/fs.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/power/smps.h>

#include <arch/armv7-m/nvicpri.h>

#include "arm_internal.h"
#include "ram_vectors.h"

#include "stm32_hrtim.h"
#include "stm32_adc.h"

#include <arch/board/board.h>

#if defined(CONFIG_EXAMPLES_SMPS) && defined(CONFIG_DRIVERS_SMPS)

#ifndef CONFIG_LIBDSP
#  error CONFIG_LIBDSP is required
#endif

#ifndef CONFIG_ARCH_HIPRI_INTERRUPT
#  error CONFIG_ARCH_HIPRI_INTERRUPT is required
#endif

#ifndef CONFIG_ARCH_RAMVECTORS
#  error CONFIG_ARCH_RAMVECTORS is required
#endif

#ifndef CONFIG_ARCH_IRQPRIO
#  error CONFIG_ARCH_IRQPRIO is required
#endif

#ifndef CONFIG_ARCH_FPU
#  warning Set CONFIG_ARCH_FPU for hardware FPU support
#endif

#if !defined(CONFIG_STM32_HRTIM1) || !defined(CONFIG_STM32_HRTIM)
#  error "SMPS example requires HRTIM1 support"
#endif

#if !defined(CONFIG_STM32_ADC1) || !defined(CONFIG_ADC)
#  error "SMPS example requires ADC1 support"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* ADC1 channels used in this example */

#define ADC1_NCHANNELS 2

/* ADC1 injected channels numeration */

#define V_IN_ADC_INJ_CHANNEL  0
#define V_OUT_ADC_INJ_CHANNEL 1

/* Voltage reference for ADC */

#define ADC_REF_VOLTAGE ((float)3.3)

/* ADC resolution */

#define ADC_VAL_MAX     4095

/* Input voltage conversion ratio - 6.8k/(6.8k + 27k) */

#define V_IN_RATIO (float)((float)(6800+27000)/(float)6800)

/* Output voltage conversion ratio - 3.3k/(3.3k + 13.3k) */

#define V_OUT_RATIO (float)((float)(3300+13300)/(float)3300)

/* Some absolute limits */

#define SMPS_ABSOLUTE_OUT_CURRENT_LIMIT_mA 250
#define SMPS_ABSOLUTE_OUT_VOLTAGE_LIMIT_mV 15000
#define SMPS_ABSOLUTE_IN_VOLTAGE_LIMIT_mV  15000

#if CONFIG_EXAMPLES_SMPS_OUT_CURRENT_LIMIT > SMPS_ABSOLUTE_OUT_CURRENT_LIMIT_mA
#  error "Output current limit great than absolute limit!"
#endif
#if CONFIG_EXAMPLES_SMPS_OUT_VOLTAGE_LIMIT > SMPS_ABSOLUTE_OUT_VOLTAGE_LIMIT_mV
#  error "Output voltage limit greater than absolute limit!"
#endif
#if CONFIG_EXAMPLES_SMPS_IN_VOLTAGE_LIMIT > SMPS_ABSOLUTE_IN_VOLTAGE_LIMIT_mV
#  error "Input voltage limit greater than absolute limit!"
#endif

/* Maximum output voltage for boost converter in float */

#define BOOST_VOLT_MAX ((float)CONFIG_EXAMPLES_SMPS_OUT_VOLTAGE_LIMIT/1000.0)

/* At this time only PID controller implemented */

#define SMPS_CONTROLLER_PID   1

/* Converter's finite accuracy */

#define SMPS_VOLTAGE_ACCURACY ((float)0.01)

/* Buck-boost mode threshold */

#define SMPS_BUCKBOOST_RANGE  ((float)0.5)

/* PID controller configuration */

#define PID_KP                ((float)1.0)
#define PID_KI                ((float)0.1)
#define PID_KD                ((float)0.0)

/* Converter frequencies:
 *   - TIMC_PWM_FREQ - buck converter 250kHz
 *   - TIMD_PWM_FREQ - boost converter 250kHz
 */

#define TIMC_PWM_FREQ 250000
#define TIMD_PWM_FREQ 250000

/* Deadtime configuration */

#define DT_RISING 0x0B0
#define DT_FALLING 0x0B0

/* Helper macros */

#define HRTIM_ALL_OUTPUTS_ENABLE(hrtim, state)                        \
  HRTIM_OUTPUTS_ENABLE(hrtim, HRTIM_OUT_TIMC_CH1|HRTIM_OUT_TIMC_CH2|  \
                       HRTIM_OUT_TIMD_CH1|HRTIM_OUT_TIMD_CH2, state);

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Current converter mode */

enum converter_mode_e
{
  CONVERTER_MODE_INIT,      /* Initial mode */
  CONVERTER_MODE_BUCK,      /* Buck mode operations  (V_in > V_out) */
  CONVERTER_MODE_BOOST,     /* Boost mode operations (V_in < V_out) */
  CONVERTER_MODE_BUCKBOOST, /* Buck-boost operations (V_in near V_out) */
};

/* SMPS lower drivers structure */

struct smps_lower_dev_s
{
  struct hrtim_dev_s     *hrtim; /* PWM generation */
  struct stm32_adc_dev_s *adc;   /* input and output voltage sense */
  struct comp_dev_s      *comp;  /* not used in this demo - only as reference */
  struct dac_dev_s       *dac;   /* not used in this demo - only as reference */
  struct opamp_dev_s     *opamp; /* not used in this demo - only as reference */
};

/* Private data for smps */

struct smps_priv_s
{
  uint8_t               conv_mode;   /* Converter mode */
  uint16_t              v_in_raw;    /* Voltage input RAW value */
  uint16_t              v_out_raw;   /* Voltage output RAW value */
  float                 v_in;        /* Voltage input real value in V */
  float                 v_out;       /* Voltage output real value in V  */
  bool                  running;     /* Running flag */
  pid_controller_f32_t  pid;         /* PID controller */
  float                *c_limit_tab; /* Current limit tab */
};

/****************************************************************************
 * Private Function Protototypes
 ****************************************************************************/

