apache/nuttx/boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
static int smps_setup(struct smps_dev_s *dev);
static int smps_shutdown(struct smps_dev_s *dev);
static int smps_start(struct smps_dev_s *dev);
static int smps_stop(struct smps_dev_s *dev);
static int smps_params_set(struct smps_dev_s *dev,
                           struct smps_params_s *param);
static int smps_mode_set(struct smps_dev_s *dev, uint8_t mode);
static int smps_limits_set(struct smps_dev_s *dev,
                           struct smps_limits_s *limits);
static int smps_state_get(struct smps_dev_s *dev,
                          struct smps_state_s *state);
static int smps_fault_set(struct smps_dev_s *dev, uint8_t fault);
static int smps_fault_get(struct smps_dev_s *dev,
                          uint8_t *fault);
static int smps_fault_clean(struct smps_dev_s *dev,
                            uint8_t fault);
static int smps_ioctl(struct smps_dev_s *dev, int cmd,
                      unsigned long arg);

static void smps_conv_mode_set(struct smps_priv_s *priv,
                               struct smps_lower_dev_s *lower,
                               uint8_t mode);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct smps_lower_dev_s g_smps_lower;
struct smps_priv_s g_smps_priv;
struct smps_s g_smps;

struct smps_ops_s g_smps_ops =
{
  .setup       = smps_setup,
  .shutdown    = smps_shutdown,
  .start       = smps_start,
  .stop        = smps_stop,
  .params_set  = smps_params_set,
  .mode_set    = smps_mode_set,
  .limits_set  = smps_limits_set,
  .fault_set   = smps_fault_set,
  .state_get   = smps_state_get,
  .fault_get   = smps_fault_get,
  .fault_clean = smps_fault_clean,
  .ioctl       = smps_ioctl
};

struct smps_dev_s g_smps_dev =
{
  .ops   = &g_smps_ops,
  .priv  = &g_smps,
  .lower = NULL
};

/* ADC configuration:
 *    - Input voltage (V_IN) - ADC1 Channel 2 (PA1)
 *    - Output voltage (V_OUT) - ADC1 Channel 4 (PA3)
 *
 * ADC channels configured in injected mode.
 *
 * Transistors configuration in buck mode:
 *    - T6 -  ON
 *    - T2 -  OFF
 *    - T5 and T1 - buck operation
 * Transistors configuration in boost mode:
 *    - T5 - ON
 *    - T1 - OFF
 *    - T6 and T2 - boost operation
 * Transistors configuration in buck-boost mode:
 *    - T5 and T1 - buck operation
 *    - T6 and T2 - boost operation
 *
 * HRTIM outputs configuration:
 *    - T5   -> PB12 -> HRTIM_CHC1
 *    - T6   -> PB14 -> HRTIM_CHD1
 *    - T1   -> PB13 -> HRTIM_CHC2
 *    - T2   -> PB15 -> HRTIM_CHD2
 */

/* ADC channel list */

static const uint8_t g_adc1chan[ADC1_NCHANNELS] =
{
  2,
  4
};

/* Configurations of pins used by ADC channel */

static const uint32_t g_adc1pins[ADC1_NCHANNELS] =
{
  GPIO_ADC1_IN2_0,                /* PA1 - V_IN */
  GPIO_ADC1_IN4_0,                /* PA3 - V_OUT */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: smps_setup
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_setup(struct smps_dev_s *dev)
{
  struct smps_lower_dev_s *lower = dev->lower;
  struct smps_s           *smps  = (struct smps_s *)dev->priv;
  struct hrtim_dev_s      *hrtim = NULL;
  struct stm32_adc_dev_s  *adc   = NULL;
  struct smps_priv_s      *priv;
  struct adc_channel_s     channels[ADC1_NCHANNELS];
  struct adc_sample_time_s stime;
  int ret = OK;
  int i   = 0;

  /* Initialize smps structure */

  smps->opmode       = SMPS_OPMODE_INIT;
  smps->state.state  = SMPS_STATE_INIT;
  smps->priv         = &g_smps_priv;

  /* Check lower half drivers */

  hrtim = lower->hrtim;
  if (hrtim == NULL)
    {
      pwrerr("ERROR:  Failed to get hrtim ");
      ret = ERROR;
      goto errout;
    }

  adc = lower->adc;
  if (adc == NULL)
    {
      pwrerr("ERROR:  Failed to get ADC lower level interface");
      ret = ERROR;
      goto errout;
    }

  /* Update ADC sample time */

  for (i = 0; i < ADC1_NCHANNELS; i += 1)
    {
      channels[i].sample_time = ADC_SMPR_92p5;
      channels[i].channel     = g_adc1chan[i];
    }

  memset(&stime, 0, sizeof(struct adc_sample_time_s));

  stime.channels_nbr = ADC1_NCHANNELS;
  stime.channel      = channels;

  STM32_ADC_SAMPLETIME_SET(adc, &stime);
  STM32_ADC_SAMPLETIME_WRITE(adc);

  /* TODO: create current limit table */

  UNUSED(priv);

errout:
  return ret;
}

/****************************************************************************
 * Name: smps_shutdown
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_shutdown(struct smps_dev_s *dev)
{
  struct smps_s      *smps = (struct smps_s *)dev->priv;
  struct smps_priv_s *priv = (struct smps_priv_s *)smps->priv;

  /* Stop smps if running */

  if (priv->running == true)
    {
      smps_stop(dev);
    }

  /* Reset smps structure */

  memset(smps, 0, sizeof(struct smps_s));

  return OK;
}

/****************************************************************************
 * Name: smps_start
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_start(struct smps_dev_s *dev)
{
  struct smps_lower_dev_s *lower = dev->lower;
  struct smps_s           *smps  = (struct smps_s *)dev->priv;
  struct smps_priv_s      *priv  = (struct smps_priv_s *)smps->priv;
  struct hrtim_dev_s      *hrtim = lower->hrtim;
  struct stm32_adc_dev_s  *adc   = lower->adc;
  volatile uint64_t per = 0;
  uint64_t fclk = 0;
  int ret = OK;

  /* Disable HRTIM outputs */

  HRTIM_ALL_OUTPUTS_ENABLE(hrtim, false);

  /* Reset SMPS private structure */

  memset(priv, 0, sizeof(struct smps_priv_s));

#ifdef SMPS_CONTROLLER_PID
  /* Initialize PID controller */

  pid_controller_init(&priv->pid, PID_KP, PID_KI, PID_KD);

  /* Set PID controller saturation */

  pid_saturation_set(&priv->pid, 0.0, BOOST_VOLT_MAX);

  /* Reset PI integral if saturated */

  pi_ireset_enable(&priv->pid, true);
#endif

  /* Get TIMC period value for given frequency */

  fclk = HRTIM_FCLK_GET(hrtim, HRTIM_TIMER_TIMC);
  per = fclk / TIMC_PWM_FREQ;
  if (per > HRTIM_PER_MAX)
    {
      pwrerr("ERROR:  Can not achieve timc pwm "
             "freq=%" PRIu32 " if fclk=%" PRIu64 "\n",
             (uint32_t)TIMC_PWM_FREQ, fclk);
      ret = -EINVAL;
      goto errout;
    }

  /* Set TIMC period value */

  HRTIM_PER_SET(hrtim, HRTIM_TIMER_TIMC, (uint16_t)per);

  /* Get TIMD period value for given frequency */

  fclk = HRTIM_FCLK_GET(hrtim, HRTIM_TIMER_TIMD);
  per = fclk / TIMD_PWM_FREQ;
  if (per > HRTIM_PER_MAX)
    {
      pwrerr("ERROR:  Can not achieve timd pwm "
             "freq=%" PRIu32 " if fclk=%" PRIu64 "\n",
             (uint32_t)TIMD_PWM_FREQ, fclk);
      ret = -EINVAL;
      goto errout;
    }

  /* Set TIMD period value */

  HRTIM_PER_SET(hrtim, HRTIM_TIMER_TIMD, (uint16_t)per);

  /* ADC trigger on TIMC CMP4 */

  HRTIM_CMP_SET(hrtim, HRTIM_TIMER_TIMC, HRTIM_CMP4, 10000);

  /* Configure TIMER C and TIMER D deadtime mode
   *
   * NOTE: In deadtime mode we have to configure output 1 only
   * (SETx1, RSTx1), output 2 configuration is not significant.
   */

  HRTIM_DEADTIME_UPDATE(hrtim, HRTIM_TIMER_TIMC, HRTIM_DT_EDGE_RISING,
                        DT_RISING);
  HRTIM_DEADTIME_UPDATE(hrtim, HRTIM_TIMER_TIMC, HRTIM_DT_EDGE_FALLING,
                        DT_FALLING);
  HRTIM_DEADTIME_UPDATE(hrtim, HRTIM_TIMER_TIMD, HRTIM_DT_EDGE_RISING,
                        DT_RISING);
  HRTIM_DEADTIME_UPDATE(hrtim, HRTIM_TIMER_TIMD, HRTIM_DT_EDGE_FALLING,
                        DT_FALLING);

  /* Set T5 and T2 to a low state.
   * Deadtime mode force T1 and T6 to a high state.
   */

  HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMC_CH1, HRTIM_OUT_SET_NONE);
  HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMC_CH1, HRTIM_OUT_RST_PER);

