apache/nuttx/boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
  HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMD_CH1, HRTIM_OUT_SET_NONE);
  HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMD_CH1, HRTIM_OUT_RST_PER);

  /* Set running flag */

  priv->running = true;

  HRTIM_ALL_OUTPUTS_ENABLE(hrtim, true);

  /* Enable ADC JEOS interrupts */

  STM32_ADC_INT_ENABLE(adc, ADC_INT_JEOS);

  /* Enable ADC12 interrupts */

  up_enable_irq(STM32_IRQ_ADC12);

  /* Start injected conversion */

  STM32_ADC_INJ_STARTCONV(adc, true);

errout:
  return ret;
}

/****************************************************************************
 * Name: smps_stop
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_stop(struct smps_dev_s *dev)
{
  struct smps_lower_dev_s *lower = dev->lower;
  struct smps_s           *smps  = (struct smps_s *)dev->priv;
  struct smps_priv_s      *priv  = (struct smps_priv_s *)smps->priv;
  struct hrtim_dev_s      *hrtim = lower->hrtim;
  struct stm32_adc_dev_s  *adc   = lower->adc;

  /* Disable HRTIM outputs */

  HRTIM_ALL_OUTPUTS_ENABLE(hrtim, false);

  /* Stop injected conversion */

  STM32_ADC_INJ_STARTCONV(adc, false);

  /* Disable ADC JEOS interrupts */

  STM32_ADC_INT_DISABLE(adc, ADC_INT_JEOS);

  /* Disable ADC12 interrupts */

  up_disable_irq(STM32_IRQ_ADC12);

  /* Reset running flag */

  priv->running = false;

  return OK;
}

/****************************************************************************
 * Name: smps_params_set
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_params_set(struct smps_dev_s *dev,
                           struct smps_params_s *param)
{
  struct smps_s *smps = (struct smps_s *)dev->priv;
  int ret = OK;

  /* Only output voltage */

  smps->param.v_out = param->v_out;

  /* REVISIT: use current and power parameters ? */

  if (param->i_out > 0)
    {
      pwrwarn("WARNING: Output current parameters not used in this demo\n");
    }

  if (param->p_out > 0)
    {
      pwrwarn("WARNING: Output power parameters not used in this demo\n");
    }

  return ret;
}

/****************************************************************************
 * Name: smps_mode_set
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_mode_set(struct smps_dev_s *dev, uint8_t mode)
{
  struct smps_s *smps = (struct smps_s *)dev->priv;
  int ret = OK;

  /* Only constant voltage mode supported */

  if (mode == SMPS_OPMODE_CV)
    {
      smps->opmode = mode;
    }
  else
    {
      pwrerr("ERROR:  Unsupported SMPS mode %d!\n", mode);
      ret = ERROR;
      goto errout;
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: smps_limits_set
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_limits_set(struct smps_dev_s *dev,
                           struct smps_limits_s *limits)
{
  struct smps_s *smps = (struct smps_s *)dev->priv;
  int ret = OK;

  /* Some assertions */

  if (limits->v_out <= 0)
    {
      pwrerr("ERROR:  Output voltage limit must be set!\n");
      ret = ERROR;
      goto errout;
    }

  if (limits->v_in <= 0)
    {
      pwrerr("ERROR:  Input voltage limit must be set!\n");
      ret = ERROR;
      goto errout;
    }

  if (limits->i_out <= 0)
    {
      pwrerr("ERROR:  Output current limit must be set!\n");
      ret = ERROR;
      goto errout;
    }

  if (limits->v_out * 1000 > CONFIG_EXAMPLES_SMPS_OUT_VOLTAGE_LIMIT)
    {
      limits->v_out = (float)CONFIG_EXAMPLES_SMPS_OUT_VOLTAGE_LIMIT / 1000.0;
      pwrwarn("WARNING: "
              "SMPS output voltage limiit > SMPS absolute output voltage "
              "limit. Set output voltage limit to %.2f.\n",
              limits->v_out);
    }

  if (limits->v_in * 1000 > CONFIG_EXAMPLES_SMPS_IN_VOLTAGE_LIMIT)
    {
      limits->v_in = (float)CONFIG_EXAMPLES_SMPS_IN_VOLTAGE_LIMIT / 1000.0;
      pwrwarn("WARNING: "
              "SMPS input voltage limiit > SMPS absolute input voltage "
              "limit. Set input voltage limit to %.2f.\n",
              limits->v_in);
    }

  if (limits->i_out * 1000 > CONFIG_EXAMPLES_SMPS_OUT_CURRENT_LIMIT)
    {
      limits->i_out = (float)CONFIG_EXAMPLES_SMPS_OUT_CURRENT_LIMIT / 1000.0;
      pwrwarn("WARNING: "
              "SMPS output current limiit > SMPS absolute output current "
              "limit. Set output current limit to %.2f.\n",
              limits->i_out);
    }

  /* Set output voltage limit */

  smps->limits.v_out = limits->v_out;

  /* Set input voltage limit */

  smps->limits.v_in = limits->v_in;

  /* Set current limit */

  smps->limits.i_out = limits->i_out;

  /* Lock limits */

  smps->limits.lock = true;

errout:
  return ret;
}

/****************************************************************************
 * Name: smps_state_get
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_state_get(struct smps_dev_s *dev,
                          struct smps_state_s *state)
{
  struct smps_s *smps = (struct smps_s *)dev->priv;

  /* Copy locally stored feedbacks data to status structure */

  smps->state.fb.v_in  = g_smps_priv.v_in;
  smps->state.fb.v_out = g_smps_priv.v_out;

  /* Return state structure to caller */

  memcpy(state, &smps->state, sizeof(struct smps_state_s));

  return OK;
}

/****************************************************************************
 * Name: smps_fault_set
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_fault_set(struct smps_dev_s *dev, uint8_t fault)
{
  return OK;
}

/****************************************************************************
 * Name: smps_fault_get
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_fault_get(struct smps_dev_s *dev, uint8_t *fault)
{
  return OK;
}

/****************************************************************************
 * Name: smps_fault_clean
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_fault_clean(struct smps_dev_s *dev, uint8_t fault)
{
  return OK;
}

/****************************************************************************
 * Name: smps_state_get
 *
 * Description:
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int smps_ioctl(struct smps_dev_s *dev, int cmd, unsigned long arg)
{
  return OK;
}

/****************************************************************************
 * Name: smps_controller
 *
 * Description:
 *
 * Returned Value:
 *
 ****************************************************************************/

static float smps_controller(struct smps_priv_s *priv, float err)
{
  float out = 0.0;

#ifdef SMPS_CONTROLLER_PID
  out = pid_controller(&priv->pid, err);
#else
#  error "At this time only PID controller implemented"
#endif

  return out;
}

/****************************************************************************
 * Name: smps_duty_set
 *
 * Description:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void smps_duty_set(struct smps_priv_s *priv,
                          struct smps_lower_dev_s *lower,
                          float out)
{
  struct hrtim_dev_s *hrtim = lower->hrtim;
  uint8_t mode = priv->conv_mode;
  uint16_t cmp = 0;
  float duty = 0.0;
  uint16_t per = 0;

  switch (mode)
    {
      case CONVERTER_MODE_INIT:
        {
          /* Do nothing */

          break;
        }

      case CONVERTER_MODE_BUCK:
        {
          if (out >= priv->v_in) out = priv->v_in;
          if (out < 0.0) out = 0.0;

