apache/nuttx/boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
          duty = out / priv->v_in;

#warning TODO: current limit in buck mode

          per = HRTIM_PER_GET(hrtim, HRTIM_TIMER_TIMC);

          cmp = (uint16_t)(per * duty);

          if (cmp > per - 30) cmp = per - 30;

          /* Set T5 duty cycle. T1 is complementary to T5 */

          HRTIM_CMP_SET(hrtim, HRTIM_TIMER_TIMC, HRTIM_CMP1, cmp);

          break;
        }

      case CONVERTER_MODE_BOOST:
        {
          per = HRTIM_PER_GET(hrtim, HRTIM_TIMER_TIMC);

          if (out < priv->v_in) out = priv->v_in;
          if (out >= BOOST_VOLT_MAX) out = BOOST_VOLT_MAX;

          duty = 1.0 - priv->v_in / out;

#warning TODO: current limit in boost mode

          cmp = (uint16_t)(per * duty);

          /* Set T2 duty cycle. T6 is complementary to T2 */

          HRTIM_CMP_SET(hrtim, HRTIM_TIMER_TIMD, HRTIM_CMP1, cmp);

          break;
        }

      case CONVERTER_MODE_BUCKBOOST:
        {
          /* Buck converter is set to fixed duty cycle (80%).
           * Now we need set boost converter
           */

          per = HRTIM_PER_GET(hrtim, HRTIM_TIMER_TIMC);

          if (out < priv->v_in) out = priv->v_in;
          if (out >= BOOST_VOLT_MAX) out = BOOST_VOLT_MAX;

          duty = 1.0 - priv->v_in / out;

#warning TODO: current limit in buck boost mode

          cmp = (uint16_t)(per * duty);

          /* Set T2 duty cycle. T6 is complementary to T2 */

          HRTIM_CMP_SET(hrtim, HRTIM_TIMER_TIMD, HRTIM_CMP1, cmp);

          break;
        }

      default:
        {
          pwrerr("ERROR:  Unknown converter mode %d!\n", mode);
          break;
        }
        }
}

/****************************************************************************
 * Name: smps_conv_mode_set
 *
 * Description:
 *   Change converter mode (buck/boost/buck-boost).
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void smps_conv_mode_set(struct smps_priv_s *priv,
                               struct smps_lower_dev_s *lower,
                               uint8_t mode)
{
  struct hrtim_dev_s *hrtim = lower->hrtim;

  /* Disable all outputs */

  HRTIM_ALL_OUTPUTS_ENABLE(hrtim, false);

  switch (mode)
    {
      case CONVERTER_MODE_INIT:
        {
          break;
        }

      case CONVERTER_MODE_BUCK:
        {
          /* Set T2 low (T6 high) on the next PER */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_SET_NONE);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_RST_PER);

          /* Set T5 to a high state on PER and reset on CMP1.
           * T1 is complementary to T5.
           */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_SET_PER);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_RST_CMP1);

          break;
        }

      case CONVERTER_MODE_BOOST:
        {
          /* Set T4 high (T11 low) on the next PER */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_SET_PER);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_RST_NONE);

          /* Set T12 to a high state on PER and reset on CMP1.
           * T5 is complementary to T12.
           */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_SET_PER);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_RST_CMP1);

          break;
        }

      case CONVERTER_MODE_BUCKBOOST:
        {
          /* Set T4 to a high state on PER and reset on CMP1.
           * T11 is complementary to T4.
           */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_SET_PER);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMC_CH1,
                               HRTIM_OUT_RST_CMP1);

          /* Set T12 to a high state on PER and reset on CMP1.
           * T5 is complementary to T12.
           */

          HRTIM_OUTPUT_SET_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_SET_PER);
          HRTIM_OUTPUT_RST_SET(hrtim, HRTIM_OUT_TIMD_CH1,
                               HRTIM_OUT_RST_CMP1);

          /* Set fixed duty cycle (80%) on buck converter (T4 and T11) */

          HRTIM_CMP_SET(hrtim, HRTIM_TIMER_TIMC, HRTIM_CMP1,
                        0.8 * ((uint16_t)HRTIM_PER_GET(hrtim,
                                                       HRTIM_TIMER_TIMC)));

          break;
        }

      default:
        {
          pwrerr("ERROR:  Unknown converter mode %d!\n", mode);
          break;
        }
    }

  /* Set mode in private data */

  priv->conv_mode = mode;

  /* Enable outputs */

  HRTIM_ALL_OUTPUTS_ENABLE(hrtim, true);
}

/****************************************************************************
 * Name: adc12_handler
 ****************************************************************************/

static void adc12_handler(void)
{
  struct smps_dev_s       *dev   = &g_smps_dev;
  struct smps_s           *smps  = (struct smps_s *)dev->priv;
  struct smps_priv_s      *priv  = (struct smps_priv_s *)smps->priv;
  struct smps_lower_dev_s *lower = dev->lower;
  struct stm32_adc_dev_s  *adc   = lower->adc;
  uint32_t pending;
  float ref = ADC_REF_VOLTAGE;
  float bit = ADC_VAL_MAX;
  float err;
  float out;
  uint8_t mode;

  pending = STM32_ADC_INT_GET(adc);

  if (pending & ADC_INT_JEOC && priv->running == true)
    {
      /* Get raw ADC values */

      priv->v_out_raw = STM32_ADC_INJDATA_GET(adc, V_OUT_ADC_INJ_CHANNEL);
      priv->v_in_raw  = STM32_ADC_INJDATA_GET(adc, V_IN_ADC_INJ_CHANNEL);

      /* Convert raw values to real values */

      priv->v_out = (priv->v_out_raw * ref / bit) * V_OUT_RATIO;
      priv->v_in  = (priv->v_in_raw * ref / bit) * V_IN_RATIO;

      /* According to measured voltages we set converter
       * in appropriate mode
       */

      if (smps->param.v_out > (priv->v_in + SMPS_BUCKBOOST_RANGE))
        {
          /* Desired output voltage greater than input voltage - set
           * boost converter
           */

