apache/nuttx/boards/arm/stm32g4/b-g474e-dpow1/src/stm32_smps.c
          mode = CONVERTER_MODE_BOOST;
        }

      else if (smps->param.v_out < (priv->v_in - SMPS_BUCKBOOST_RANGE))
        {
          /* Desired output voltage lower than input voltage - set
           * buck converter
           */

          mode = CONVERTER_MODE_BUCK;
        }

      else
        {
          /* Desired output voltage close to input voltage - set
           * buck-boost converter
           */

          mode = CONVERTER_MODE_BUCKBOOST;
        }

      /* Configure converter to the new mode if needed */

      if (priv->conv_mode != mode)
        {
          smps_conv_mode_set(priv, lower, mode);
        }

      /* Get regulator error */

      err = smps->param.v_out - priv->v_out;

      if (err >= SMPS_VOLTAGE_ACCURACY || err <= (-SMPS_VOLTAGE_ACCURACY))
        {
          /* PID controller */

          out = smps_controller(priv, err);

          /* Update duty cycle */

          smps_duty_set(priv, lower, out);
        }
    }

  /* Clear pending */

  STM32_ADC_INT_ACK(adc, pending);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_smps_setup
 *
 * Description:
 *   Initialize SMPS driver.
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

int stm32_smps_setup(void)
{
  struct smps_lower_dev_s *lower = &g_smps_lower;
  struct smps_dev_s *smps        = &g_smps_dev;
  struct hrtim_dev_s *hrtim      = NULL;
  struct adc_dev_s *adc          = NULL;
  static bool initialized        = false;
  int ret                        = OK;
  int i;

  /* Initialize only once */

  if (!initialized)
    {
      /* Get the HRTIM interface */

      hrtim = stm32_hrtiminitialize();
      if (hrtim == NULL)
        {
          pwrerr("ERROR:  Failed to get HRTIM1 interface\n");
          return -ENODEV;
        }

      /* Configure the pins as analog inputs for the selected channels */

      for (i = 0; i < ADC1_NCHANNELS; i++)
        {
          stm32_configgpio(g_adc1pins[i]);
        }

      /* Get the ADC interface */

      adc = stm32_adcinitialize(1, g_adc1chan, ADC1_NCHANNELS);
      if (adc == NULL)
        {
          pwrerr("ERROR:  Failed to get ADC %d interface\n", 1);
          return -ENODEV;
        }

      /* Initialize SMPS lower driver interfaces */

      lower->hrtim = hrtim;
      lower->adc   = adc->ad_priv;
      lower->comp  = NULL;
      lower->dac   = NULL;
      lower->opamp = NULL;

      /* Attach ADC12 ram vector */

      ret = arm_ramvec_attach(STM32_IRQ_ADC12, adc12_handler);
      if (ret < 0)
        {
          pwrerr("ERROR:  arm_ramvec_attach failed: %d\n", ret);
          ret = EXIT_FAILURE;
          goto errout;
        }

      /* Set the priority of the ADC12 interrupt vector */

      ret = up_prioritize_irq(STM32_IRQ_ADC12, NVIC_SYSH_HIGH_PRIORITY);
      if (ret < 0)
        {
          pwrerr("ERROR:  up_prioritize_irq failed: %d\n", ret);
          ret = EXIT_FAILURE;
          goto errout;
        }

      /* Setup ADC hardware */

      adc->ad_ops->ao_setup(adc);

      /* We do not need register character drivers for SMPS lower
       * peripherals. All control should be done via SMPS character
       * driver.
       */

      ret = smps_register(CONFIG_EXAMPLES_SMPS_DEVPATH, smps, (void *)lower);
      if (ret < 0)
        {
          pwrerr("ERROR:  smps_register failed: %d\n", ret);
          return ret;
        }

      initialized = true;
    }

errout:
  return ret;
}

#endif /* CONFIG_EXAMPLE_SMPS && CONFIG_DRIVERS_SMPS*/
